feaser/openblt/Target/Source/ARMCM0_STM32G0/flash.c
  /* search through the sectors to find the right one */
  for (sectorIdx = 0; sectorIdx < FLASH_TOTAL_SECTORS; sectorIdx++)
  {
    /* keep the watchdog happy */
    CopService();
    if (flashLayout[sectorIdx].sector_num == sector)
    {
      return flashLayout[sectorIdx].sector_size;
    }
  }
  /* still here so no valid sector found */
  return 0;
} /*** end of FlashGetSectorSize ***/


/************************************************************************************//**
** \brief     Determines the flash bank that the address belongs to.
** \param     address Flash memory address.
** \return    FLASH_BANK_1 if the address belongs to bank 1, FLASH_BANK_2 otherwise.
**
****************************************************************************************/
static blt_int32u FlashGetBank(blt_addr address)
{
  blt_int32u result = FLASH_BANK_1;

  /* assert that the address is actually a valid flash address */
  ASSERT_RT(address >= FLASH_BASE);
  ASSERT_RT((address - FLASH_BASE) < FLASH_SIZE);

  /* bank 2 is only possible on dual bank flash devices. for these devices, macro
   * FLASH_DBANK_SUPPORT is defined.
   */
#if defined (FLASH_DBANK_SUPPORT)
  /* is the address in bank 2? */
  if ((address - FLASH_BASE) >= FLASH_BANK_SIZE)
  {
    /* update the result */
    result = FLASH_BANK_2;
  }
#endif

  /* give the result back to the caller */
  return result;
} /** end of FlashGetBank ***/


/************************************************************************************//**
** \brief     Determines the flash page that the address belongs to.
** \param     address Flash memory address.
** \return    Page number.
**
****************************************************************************************/
static blt_int32u FlashGetPage(blt_addr address)
{
  blt_int32u result = 0;

  /* assert that the address is actually a valid flash address */
  ASSERT_RT(address >= FLASH_BASE);
  ASSERT_RT((address - FLASH_BASE) < FLASH_SIZE);

  /* is the address in the first bank? */
  if (FlashGetBank(address) == FLASH_BANK_1)
  {
    result = (address - FLASH_BASE) / FLASH_ERASE_BLOCK_SIZE;
  }
#if defined (FLASH_DBANK_SUPPORT)
  /* the address is in the second bank, which can only happen on dual bank flash
   * devices.
   */
  else
  {
    /* sanity check. the address must be equal or greater than the start address of
     * the second bank.
     */
    ASSERT_RT(address >= (FLASH_BASE + FLASH_BANK_SIZE));

    /* in the second bank, the page number always starts at 256. start by getting the
     * page number from the start of the bank. next, add the 256 offset.
     */
    result  = (address - FLASH_BASE - FLASH_BANK_SIZE) / FLASH_ERASE_BLOCK_SIZE;
    result += 256U;
  }
#endif

  /* give the result back to the caller */
  return result;
} /*** end of FlashGetPage ***/


/*********************************** end of flash.c ************************************/
